Repository: DeadpanSplash82/Auction-program
Catalog: translations/*/LC_MESSAGES/auction.po
Languages: af

# title
source: Auction program
af: Veiling program

# mnu_lang_change
source: Language
af: Taal

source: File
af: Leer

source: Open File
af: Maak leer oop

source: Save File
af: Stoor leer

source: New File
af: Nuwe leer

# mnu_add_bidder
source: Add bidder
af: Voeg bieer by

# mnu_add_lot
source: Add lot
af: Voeg lot by

# lang_change_instr
source: Please select a language:
af: Kies asseblief 'n taal:

# total_bidders
source: Number of bidders:
af: Aantal bieers:

# new_name
source: New bidder's name :
af: Nuwe bieer se naam:

# btn_add_bidder
source: Add bidder
af: Voeg bieer by

# btn_add_mult_bidder
source: Add multiple bidders
af: Voeg verskeie bieers by

# total_lots
source: Number of lots:
af: Aantal lotte:

# new_lot
source: New lot's name :
af: Nuwe lot se naam:

# btn_add_lot
source: Add lot
af: Voeg lot by

# btn_add_mult_lot
source: Add multiple lots
af: Voeg verskeie lotte by

# mnu_auction
source: Auction
af: Veiling

source: Total made
af: Totaal ingesamel

source: of end goal
af: van die einddoel

source: Current lot
af: Huidige lot

source: Current bid:
af: Huidige bie:

source: from
af: deur

# btn_new_bid
source: New bid
af: Nuwe bie

# btn_close_lot
source: Close lot
af: Sluit lot

# btn_next_lot
source: Next lot
af: Volgende lot

source: Select lot
af: Kies lot

source: Close
af: Sluit

# close_confirm
source: Are you sure you want to close the program? All unsaved changes will be lost.
af: Is jy seker jy wil die program verlaat? Alle ongestoorde data sal verlore gaan.

source: Confirmation
af: Bevestiging

source: Error
af: Fout

# err_no_auction
source: No auction to save
af: Daar is geen veilingom te stoor nie

# save_header
source: Save file
af: Stoor veiling

# save_success
source: File saved successfully
af: Veiling is suksesvol gestoor

# err_no_file
source: No file selected
af: Daar is geen leer gekies om te oop te maak nie

# err_wrong_format
source: Selected file is not an Excel file
af: Die gekose leer is nie Excel leer nie

# err_reading
source: An error occurred while reading the file
af: Daar was 'n probleem met die lees van die leer

# err_no_auction_data
source: The selected file does not contain auction data
af: Die gekose leer bevat geen veiling data nie

# save_confirmation
source: Would you like to save the current auction? All unsaved changes will be lost.
af: Wil jy die huidige veilig stoor? Enige ongestoorde data sal verlore gaan.

source: New auction
af: Nuwe veiling

# new_auction_name
source: Enter a new auction name
af: Nuwe veiling se naam

# new_auction_goal
source: Enter a new goal in R
af: Nuwe veilig se einddoel in R

# err_name_empty
source: Name cannot be empty
af: Die naam mag nie leeg wees nie

# err_name_default
source: Name cannot be the default name
af: Die naam mag nie die standaard naam wees nie

# err_name_exists
source: Name already exists
af: Die naam bestaan reeds

# mult_bidders_header
source: Add multiple bidders
af: Voeg verskeie bieers by

# mult_bidders_instr1
source: Enter the amount of bidders you would like to add. They will be named "
af: Hoeveel bieers wil jy byvoeg? Hulle sal as volg benoem word "

# mult_bidders_instr2
source: [number]" starting from number =
af: [nommer]" beginnende by nommer =

# err_name_exists1
source: Error. Name: "
af: Fout. Naam: "

# err_name_exists2
source: " exists
af: " bestaan reeds

# curr_bidders
source: Current bidders
af: Huidige bieers

source: None
af: Geen

source: Enter name
af: Voer naam in

source: Enter lot
af: Voer lot in

# mult_lots_header
source: Add multiple lots
af: Voeg verskeie lotte by

# mult_lots_instr1
source: Enter the amount of lots you would like to add. They will be named "
af: Hoeveel lotte wil jy byvoeg? Hulle sal as volg benoem word "

# mult_lots_instr2
source: [number]" starting from number =
af: [nommer]" beginnende by nommer =

# curr_lots
source: Current lots
af: Huidige lotte

# err_nan
source: Error. Not a valid number
af: Fout. Die waarde moet 'n getal wees

# err_no_amount
source: Error. No amount entered
af: Fout. Geen bedrag ingevoer nie

# err_neg_amount
source: Error. Negative amount entered
af: Fout. Negatiewe bedrag ingevoer

# err_no_bidder
source: Error. No bidder selected
af: Fout. Geen bieer gekies nie

# err_no_lot
source: Error. No lot selected
af: Fout. Geen lot gekies nie

# err_bid_too_low
source: Error. Bid is too low
af: Fout. Die bie is te laag

# select_bidder_from_list
source: Select a bidder from the list below
af: Kies 'n bieer van die lys

# select_bidder
source: Pick a bidder
af: Kies 'n bieer

# enter_bid_amount
source: Enter a bid amount
af: Voer 'n bie bedrag in

source: Add bid
af: Voeg bie by

# err_bidder_out_of_range
source: Error. Bidder is out of range
af: Fout. Die bieer is buite die bereik van die lot

# err_no_bid
source: Error. No bid added
af: Fout. Geen bie ingevoer nie

source: closed
af: gesluit

source: Final amount:
af: Finale bedrag:

# select_lot_from_list
source: Select a lot from the list below
af: Kies 'n lot van die lys

# pick_lot
source: Pick a lot
af: Kies 'n lot

source: Select
af: Kies

# err_no_current_auction
source: Please open an auction file or create a new one.
af: Maak asseblief 'n veiling oop of skep 'n nuwe een.

# err_bidder_already_highest
source: Error. Bidder already has the highest bid.
af: Fout. Die bieer het reeds die hoogste bie.

# err_close_lot
source: Close the current lot before saving the auction.
af: Maak eers die huidige lot toe voordat jy die veiling stoor.

source: Price
af: Prys

source: Yes
af: Ja

source: No
af: Nee

source: Exit
af: Verlaat
